Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: If the file at path is inaccessible to your app, perhaps because it does not have search privileges for one or more parent directories, this method returns false.
ja: pathでのファイルがあなたのアプリにアクセスできないならば、おそらくそれがひとつ以上の親ディレクトリに対する検索特権を持たないため、このディレクトリはfalseを返します。

source: If the file at path is inaccessible to your app, perhaps because one or more parent directories are inaccessible, this method returns false.
ja: pathでのファイルがあなたのアプリにアクセスできないならば、おそらく１つ以上の親ディレクトリがアクセスできないため、このメソッドはfalseを返します。

source: If the file handle object owns its file descriptor, it automatically closes that descriptor when it is deallocated.
ja: ファイルハンドルオブジェクトがそれのファイル記述子を所有するならば、それはその記述子をそれがデアロケートされる時に自動的に閉じます。

source: If the file handle object owns the file descriptor, you must not close it yourself.
ja: ファイルハンドルオブジェクトがファイル記述子を所有するならば、あなたはそれをあなた自身で閉じる必要があります。

source: If the file has a resource fork, the returned value does not include the size of the resource fork.
ja: ファイルがリソースフォークを持つならば、戻り値はリソースフォークのサイズを含みません。

source: If the file is extended (if offset is beyond the current end of file), the added characters are null bytes.
ja: ファイルが延長されるならば（offsetが現在のファイル終端を越えるならば）、加えられる文字はnullバイトです。

source: If the file is opened when unlocked, you may continue to access the file normally, even if the user locks the device.
ja: アンロックされた時にファイルが開かれるならば、あなたはファイルに普通にアクセスを継続できるでしょう、たとえユーザがデバイスをロックするとしても。

source: If the file wrapper does not have a preferred filename, set the preferred Filename property to give it one before calling add File Wrapper(_:).
ja: ファイルラッパーが優先ファイル名を持たないならば、preferred Filenameを設定してやっつけてください、add File Wrapper(_:)を呼び出す前に。

source: If the file wrapper needs updating, use the read(from: options:) method with the NSFile Wrapper Reading Immediate reading option.
ja: ファイルラッパーが更新を必要とするならば、read(from: options:)メソッドをNSFile Wrapper Reading Immediate読み出しオプションとともに使ってください。

source: If the final element in path specifies a symbolic link, this method traverses the link and returns true or false based on the existence of the file at the link destination.
ja: pathでの最後の要素がシンボリックリンクを指定するならば、このメソッドはそのリンクを辿って、リンク目的地でのファイルの実在に基づいてtrueまたはfalseを返します。

source: If the first object being tested implements the appropriate method for the comparison operation, it will be used.
ja: テストされる最初のオブジェクトが適切なメソッドを比較演算に対して実装するならば、それが使われるでしょう。

source: If the first object doesn’t implement the appropriate method but the second object implements the inverse, the inverted comparison is performed.
ja: 最初のオブジェクトが適切なメソッドを実装しない、しかし２番目のオブジェクトが逆のものを実装するならば、逆にされた比較が実行されます。

source: If the hashes for {E, A, C, B, F} are {32, 25, 99, 96, 17}, then by using the mapping table you can get a first order sort {#3, #0, ?, #1, #4}, so therefore create an initial semi-sorted array {A, B, E, F}, and then perform a cheap merge sort with {C} that yields {A, B, C, E, F}.
ja: {E, A, C, B, F} に対するハッシュが {32, 25, 99, 96, 17} ならば、そのときマッピングテーブルを使うことによってあなたは第一次ソート {#3, #0, ?, #1, #4} を得ることができ、それによってまず初めに半ばソートされた配列 {A, B, E, F} を作成して、それから {C} と安価なマージソートを行うことができ、それは {A, B, C, E, F} を生成します。

source: If the input transform can potentially fall into this case then the inverted() method is suggested to be used instead since that will return an optional value that will be nil in the case that the matrix cannot be inverted.
ja: 入力変換が潜在的にこの場合に陥るならば、その時inverted()メソッドが代わりに使われることを提案されます、それがオプショナル値を返すからです。それはマトリックスが反転されることができない場合にnilになります。

source: If the item at path is a symbolic link, it is not traversed.
ja: pathでの項目がシンボリックリンクならば、それは辿られません。

source: If the item at src Path is a directory, this method copies the directory and all of its contents, including any hidden files.
ja: src Pathでの項目がディレクトリならば、このメソッドはそのディレクトリとそれの内容の全てをコピーします、あらゆる不可視ファイルを含めて。

source: If the item at src Path is a directory, this method moves the directory and all of its contents, including any hidden files.
ja: src Pathでの項目がディレクトリならば、このメソッドはそのディレクトリとそれの内容の全てを移動します、あらゆる不可視ファイルを含めて。

source: If the item at src URL is a directory, this method copies the directory and all of its contents, including any hidden files.
ja: src URLでの項目がディレクトリならば、このメソッドはそのディレクトリとそれの内容の全てをコピーします、あらゆる不可視ファイルを含めて。

source: If the item at src URL is a directory, this method moves the directory and all of its contents, including any hidden files.
ja: src URLでの項目がディレクトリならば、このメソッドはそのディレクトリとそれの内容の全てを移動します、あらゆる不可視ファイルを含めて。

source: If the item at the path is a symbolic link—that is, the value of the type key in the attributes dictionary is type Symbolic Link—you can use the destination Of Symbolic Link(at Path:) method to retrieve the path of the item pointed to by the link.
ja: パスでの項目がシンボリックリンクである — すなわち、属性辞書の中のtypeキーの値がtype Symbolic Linkである — ならば、あなたはdestination Of Symbolic Link(at Path:)メソッドを使ってそのリンクによって指し示される項目のパスを得ることができます。

source: If the item being moved is a directory, the file manager notifies the delegate only for the directory itself and not for any of its contents.
ja: 移動される項目がディレクトリならば、ファイルマネージャは委任先にディレクトリ自身についてだけ通知します、それの内容のどれかについてはしません。

source: If the item exists locally, calling this method synchronizes the local copy with the version in the cloud.
ja: 項目がローカルに存在するならば、このメソッドの呼び出しは、ローカルコピーをクラウドにおけるバージョンと一致させます。

source: If the item specified by dest URL is a directory, returning false prevents links from being created to both the directory and its children.
ja: dest URLによって指定された項目がディレクトリならば、falseを返すことは、ディレクトリとそれの子の両方が作成されることを防ぎます。

source: If the keys used in your serialized data format don't match the property names from your data type, provide alternative keys by specifying String as the raw-value type for the Coding Keys enumeration.
ja: あなたの特殊化されたデータ型において使われるキーがあなたのデータ型からのプロパティ名と一致しないならば、代替のキーの提供をStringをCoding Keys列挙に対する生の値型として指定することによって行ってください。

source: If the last component of src Path is a symbolic link, only the link is copied to the new path.
ja: src Pathの最後の構成要素がシンボリックリンクならば、そのリンクだけが新しいパスにコピーされます。

source: If the last component of src Path is a symbolic link, only the link is moved to the new path; the item pointed to by the link remains at its current location.
ja: src Pathの最後の構成要素がシンボリックリンクならば、そのリンクだけが新しいパスに移動されます；リンクによって指し示される項目はそれの現在の位置にとどまります。

source: If the last component of src URL is a symbolic link, only the link is copied to the new path.
ja: src URLの最後の構成要素がシンボリックリンクならば、そのリンクだけが新しいパスにコピーされます。

source: If the last component of src URL is a symbolic link, only the link is moved to the new path; the item pointed to by the link remains at its current location.
ja: src URLの最後の構成要素がシンボリックリンクならば、そのリンクだけが新しいパスに移動されます；リンクによって指し示される項目はそれの現在の位置にとどまります。

source: If the last component of the path is a symbolic link it is traversed.
ja: パスの最後の構成要素がシンボリックリンクならば、それは辿られます。

source: If the location plus the length of the range is greater than the count of the array, this method raises an NSRange Exception.
ja: その位置にこの範囲の長さを加えたものが配列を勘定したものより大きいならば、このメソッドはNSRange Exceptionを引き起こします。

source: If the maximum length exceeds the number of elements in the collection, the result contains all the elements in the collection.
ja: 最大長がコレクションの要素の数を超えるならば、結果はコレクションの要素すべてを含みます。

source: If the maximum length exceeds the number of elements in the collection, the result contains the entire collection.
ja: 最大長がコレクションの要素の数を超えるならば、結果はコレクション全体を含みます。

source: If the new object can’t be initialized, the method should return nil.
ja: 新しいオブジェクトが初期化されることができなかったならば、そのメソッドはnilを返すべきです。

source: If the nib file contains any proxy objects beyond just the File’s Owner proxy object, you can specify the runtime replacement objects for those proxies using the options dictionary.
ja: nibファイルがFile’s Ownerプロキシオブジェクトだけでなく何らかのプロキシオブジェクトを含むならば、あなたは実行時置換オブジェクトをそういったプロキシに対してオプション辞書を使って指定できます。

source: If the number of elements to drop exceeds the number of elements in the collection, the result is an empty subsequence.
ja: 省かれることになる要素の数がコレクションの要素の数を超えるならば、結果は空の下位シーケンスになります。

source: If the object is not found, returns NSNot Found.
ja: オブジェクトが見つけられないならば、NSNot Foundが返ります。

source: If the object is not found, returns the index of the least greater object, or the index at the end of the array if the object is larger than all other elements.
ja: オブジェクトが見つけられないならば、最小のより大きいオブジェクトのインデックス、またはオブジェクトが全ての他の要素より大きいならば配列の最後のインデックスが返ります。

source: If the path specifies a directory, the contents of that directory are recursively removed.
ja: パスがディレクトリを指定するならば、そのディレクトリの内容は再帰的に除去されます。

source: If the preferred localization is not available, this property chooses the most appropriate localization found in the bundle.
ja: 優先ローカライゼーションが利用可能でないならば、このプロパティは、バンドルの中で見つけられる最も適切なローカライゼーションを選びます。

source: If the principal class is not specified in the information dictionary, the bundle identifies the first class loaded as the principal class.
ja: プリンシパルクラスが情報辞書において指定されないならば、バンドルは、ロードされる最初のクラスをプリンシパルクラスとして識別します。

source: If the range is empty, this function will return 0 without copying anything.
ja: 範囲が空ならば、この関数は、何もコピーすることなく０を返します。

source: If the range is nil, as much data as will fit into buffer is copied.
ja: 範囲がnilならば、bufferへとピッタリ合うのと同じだけのデータがコピーされます。

source: If the receiver has a valid AEDesc structure, returns a pointer to it; otherwise returns nil.
ja: レシーバが有効なAEDesc構造体を持つならば、それに対するポインタを返します；そうでなければnilを返します。

source: If the receiver is a communications channel, the method reads up to length bytes from the channel.
ja: レシーバが通信経路ならば、メソッドはlengthバイトに至るまでこの経路から読み込みます。

source: If the receiver is a communications channel, this method reads up to a buffer of data and returns it; if no data is available, the method blocks.
ja: レシーバが通信経路ならば、このメソッドはデータのバッファに達するまで読み込んでそれを返します；データが利用可能でないならば、メソッドは遮断します。

source: If the receiver is a file, this method returns the data obtained by reading length bytes starting at the current file pointer.
ja: レシーバがファイルならば、このメソッドはlengthバイトを現在のファイルポインタから開始して読み込むことによって得られるデータを返します。

source: If the receiver is a file, this method returns the data obtained by reading the file from the current file pointer to the end of the file.
ja: レシーバがファイルならば、このメソッドは現在のファイルポインタからファイルの終端までそのファイルを読み出すことによって取得されるデータを返します。

source: If the receiver is a file, writing takes place at the file pointer’s current position.
ja: レシーバがファイルならば、書き出しは、ファイルポインタの持つ現在の位置で発生します。

source: If the receiver is able to parse string, upon return contains a date representation of string.
ja: レシーバがstringを構文解析可能ならば、戻りにおいて、stringの日付表現を含みます。

source: If the receiver is able to parse string, upon return contains the range of string used to create the date.
ja: レシーバがstringを構文解析可能ならば、戻りにおいて、日付を作成するにの使われるstringの範囲を含みます。

source: If the receiver is an instance, a Selector should refer to an instance method; if the receiver is a class, it should refer to a class method.
ja: レシーバがインスタンスならば、a Selectorは勿論インスタンスメソッドを参照するはずです；レシーバがクラスならば、それはクラスメソッドを参照するはずです。

source: If the receiver is earlier than another Date, the return value is negative.
ja: レシーバがanother Dateより早いならば、戻り値は負です。

source: If the receiver is unable to create a date by parsing string, upon return contains an NSError object that describes the problem.
ja: レシーバがstringを構文解析することによって日付を作成できないならば、戻りにおいて、問題を記述するNSErrorオブジェクトを含みます。

source: If the relationship between the items is determined successfully, this method sets the value of the out Relationship parameter to an appropriate value.
ja: 項目間の関係がうまく判定されたならば、このメソッドはout Relationshipパラメータの値を適切な値に設定します。

source: If the request is successful, this property contains a dictionary with zero or more NSFile Provider Service Name keys and their corresponding NSFile Provider Service values; otherwise, it is set to nil.
ja: 要請がうまくいくならば、このプロパティはゼロ以上のNSFile Provider Service Nameキーとそれの対応するNSFile Provider Service値を持つ辞書を含みます；そうでなければ、それはnilに設定されます。

source: If the result is mutated and is not a unique reference, then the Data will still follow copy-on-write semantics.
ja: 結果が可変であるそして固有な参照ではないならば、そのときDataは依然としてコピーオンライト意味論に従います。

source: If the result of init(contents Of: error:), compile And Return Error(_:), execute And Return Error(_:), or execute Apple Event(_: error:), signals failure (nil, false, nil, or nil, respectively), a pointer to an autoreleased dictionary is put at the location pointed to by the error parameter.
ja: init(contents Of: error:)、compile And Return Error(_:)、execute And Return Error(_:)、またはexecute Apple Event(_: error:)の結果が、失敗（それぞれnil、false、nil、またはnil）を合図するならば、オートリリース辞書へのポインタは、エラーパラメータによって指し示される位置に向けられます。

source: If the result of this operation requires more precision than the Decimal type can provide, the result is rounded using the plain rounding mode.
ja: この演算の結果がDecimal型が提供可能であるよりさらに精度を要求するならば、結果はplain丸めモードを使って丸められます。

source: If the result returned is non-nil, then [result range] will always be a valid range, so it is not necessary to compare it against {NSNot Found, 0}.
ja: 返される結果がnilでないならば、[result range]は常に有効な範囲であるので、それを{NSNot Found, 0}と比較することは、必要ではありません。

source: If the resulting value is mutated, then Data will invoke the mutable Copy() function on the reference to copy the contents.
ja: 結果の値が可変にされるならば、そのときDataはmutable Copy()関数を参照上で発動することで、内容をコピーします。

source: If the returned range’s length field is 0, then the two ranges don’t intersect, and the value of the location field is undefined.
ja: 返される範囲の長さフィールドが０ならば、そのとき２つの範囲は交わりません、そして位置フィールドの値は未定義です。

source: If the sending application is in an App Sandbox, notification Info must be nil.
ja: 送信するアプリケーションがApp Sandboxの中ならば、notification Infoはnilである必要があります。

source: If the sending application is in an App Sandbox, user Info must be nil.
ja: 送信するアプリケーションがApp Sandboxの中ならば、user Infoはnilである必要があります。

source: If the sequence has no elements, next Partial Result is never executed and initial Result is the result of the call to reduce(_: _:).
ja: シーケンスが１つも要素を持たないならば、next Partial Resultは決して実行されません、そしてinitial Resultはreduce(_: _:)への呼び出しの結果となります。

source: If the sequence has no elements, update Accumulating Result is never executed and initial Result is the result of the call to reduce(into: _:).
ja: シーケンスが１つも要素を持たないならば、update Accumulating Resultは決して実行されません、そしてinitial Resultはreduce(into: _:)への呼び出しの結果となります。

source: If the sequence has no elements, returns nil.
ja: シーケンスが要素を持たないならば、nilを返します。

source: If the sequence has no elements, the result is initial Result.
ja: シーケンスが１つも要素を持たないならば、結果はinitial Resultです。

source: If the sequence has no elements, the result is an empty subsequence.
ja: シーケンスが１つも要素を持たないならば、結果は空のシーケンスです。

source: If the source and destination of the move operation are not on the same volume, this method copies the item first and then removes it from its current location.
ja: 移動操作の出所と行き先が同じボリュームでないならば、このメソッドは項目をまずコピーします、それからそれをそれの現在の位置から除去します。

source: If the specified file is in the process of being uploaded to iCloud, you must not call this method until the upload has finished.
ja: 指定されたファイルがiCloudにアップロードされる処理中ならば、あなたはアップロードが完了するまでこのメソッドを呼びだしてはなりません。

source: If the specified item is a directory, returning false prevents both the directory and its children from being deleted.
ja: 指定された項目がディレクトリならば、falseを返すことは、ディレクトリとそれの子の両方が削除されるのを防ぎます。

source: If the start dates are equal, then it will order by duration.
ja: 開始日付が等しいならば、その時それは期間によって順番付けをします。

source: If the structure of your Swift type differs from the structure of its encoded form, you can provide a custom implementation of Encodable and Decodable to define your own encoding and decoding logic.
ja: あなたのSwift型の構造体がそれのエンコード形式の構造体と異なるならば、あなたはEncodableおよびDecodableのあつらえの実装を提供することであなた独自のエンコードおよびデコード論理を定義できます。

source: If the symbolic link is specified as a relative path, that relative path is returned.
ja: シンボリックリンクが相対パスとして指定されるならば、その相対パスが返されます。

source: If the time zone property is set in the Date Components, it is used.
ja: タイムゾーンプロパティがDate Componentsに設定されるならば、それが使われます。

source: If the two rectangles don’t overlap, the returned rectangle has its origin at (0.0, 0.0) and zero width and height (including situations where the intersection is a point or a line segment).
ja: ２つの矩形が重ならないならば、返される矩形はそれの起点で (0.0, 0.0) そしてゼロの幅と高さを持ちます（交差が点か線分であるところの状況を含みます）。

source: If the two-digit start date is set to January 6, 1976, then “January 1, 76” is interpreted as New Year's Day in 2076, whereas “February 14, 76” is interpreted as Valentine's Day in 1976.
ja: ２桁開始日付が January 6, 1976 ならば、その時 “January 1, 76” は2076年の元旦と解釈されます、一方で “February 14, 76” は1976年のバレンタインデーと解釈されます。

source: If the user change is a deletion, orig Sel Range contains the range of the deleted characters.
ja: ユーザの変更が削除ならば、orig Sel Rangeは削除された文字の範囲を含みます。

source: If the user-defined function doesn't perform any encoding at all, an empty JSON object is encoded instead.
ja: ユーザ定義関数がどんなエンコーディングも全く実行しないならば、空のJSONオブジェクトが代わりにエンコードされます。

source: If the user-defined function throws, an empty container is encoded in place of the data.
ja: ユーザ定義関数がスローするならば、空のコンテナがデータの代わりにエンコードされます。

source: If the user-defined function throws, the error propagates upward.
ja: ユーザ定義関数がスローするならば、エラーは上に伝わります。

source: If the value is use Default, the formatter uses platform-appropriate settings; otherwise will only the specified units are used.
ja: この値がuse Defaultならば、フォーマッタはプラットホームに適した設定を使います；そうでなければ指定された単位のみが使われます。

source: If the value is false, you can typically assume American measurement units (for example, the statute mile).
ja: 値がfalseならば、あなたは概ねアメリカ寸法単位を仮定できます（例えば、法定マイル）。

source: If the width or height of a Rect is 0 or negative, this function returns a rectangle with origin at (0.0, 0.0) and with zero width and height.
ja: a Rectの幅または高さが0または負であるならば、この関数は起点 (0.0, 0.0) を持ちそしてゼロの幅と高さを持つ矩形を返します。

source: If there are two or more matching times (all the components are the same, including isLeapMonth) before the end of the next instance of the next higher component to the highest specified component, then the algorithm will return the first occurrence.
ja: 最も高位の指定された構成要素に対して次に高位の構成要素の次のインスタンスの最後の前に、２つ以上の合致する時刻（すべての構成要素が同じである、isLeapMonthを含めて）があるならば、そのときアルゴリズムは最初の出現を返します。

source: If there are two or more matching times (all the components are the same, including isLeapMonth) before the end of the next instance of the next higher component to the highest specified component, then the algorithm will return the last occurrence.
ja: 最も高位の指定された構成要素に対して次に高位の構成要素の次のインスタンスの最後の前に、２つ以上の合致する時刻（すべての構成要素が同じである、isLeapMonthを含めて）があるならば、そのときアルゴリズムは最後の出現を返します。

source: If there is already an item with the same name as the backup item, that item will be removed.
ja: バックアップ項目と同じ名前を持つ項目が既にあるならば、その項目は取り除かれます。

source: If there is an error copying an item, the file manager may also call the delegate’s file Manager(_: should Proceed After Error: copying Item At: to:) or file Manager(_: should Proceed After Error: copying Item At Path: to Path:) method to determine how to proceed.
ja: 項目のコピーに関してエラーがあるならば、ファイルマネージャはまた委任先の持つfile Manager(_: should Proceed After Error: copying Item At: to:)またはfile Manager(_: should Proceed After Error: copying Item At Path: to Path:)メソッドを呼び出してどのように続けるか決定します。

source: If there is an error linking one out of several items, the file manager may also call the delegate’s file Manager(_: should Proceed After Error: linking Item At: to:) or file Manager(_: should Proceed After Error: linking Item At Path: to Path:) method to determine how to proceed.
ja: 項目のコピーに関してエラーがあるならば、ファイルマネージャはまた委任先の持つfile Manager(_: should Proceed After Error: linking Item At: to:)またはfile Manager(_: should Proceed After Error: linking Item At Path: to Path:)メソッドを呼び出してどのように続けるか決定します。

source: If there is an error moving one out of several items, the file manager may also call the delegate’s file Manager(_: should Proceed After Error: moving Item At: to:) or file Manager(_: should Proceed After Error: moving Item At Path: to Path:) method to determine how to proceed.
ja: 項目の移動に関してエラーがあるならば、ファイルマネージャはまた委任先の持つfile Manager(_: should Proceed After Error: linking Item At: to:)またはfile Manager(_: should Proceed After Error: linking Item At Path: to Path:)メソッドを呼び出してどのように続けるか決定します。

source: If there is an error removing an item, the file manager may also call the delegate’s file Manager(_: should Proceed After Error: removing Item At:) or file Manager(_: should Proceed After Error: removing Item At Path:) method to determine how to proceed.
ja: 項目の削除に関してエラーがあるならば、ファイルマネージャはまた委任先の持つfile Manager(_: should Proceed After Error: removing Item At:)またはfile Manager(_: should Proceed After Error: removing Item At Path:)メソッドを呼び出してどのように続けるか決定します。

source: If there is no file or directory at path, or if an error occurs, returns path as is.
ja: pathでファイルまたはディレクトリがないならば、またはエラーが発生するならば、pathがそのまま返されます。

source: If there is no item at path, returns nil.
ja: pathで項目がないならば、nilが返されます。

source: If there is no matching element, returns NULL.
ja: 合致する要素がないならば、NULLを返します。

source: If there is no matching time before the end of the next instance of the next higher component to the highest specified component in the Date Components argument, the algorithm will return the next existing time which exists.
ja: Date Components引数の中の最も高位の指定された構成要素に対して次に高位の構成要素の次のインスタンスの最後の前に合致する時刻がないならば、アルゴリズムは存在する次の現存の時刻を返すでしょう。

source: If there is no matching time before the end of the next instance of the next higher component to the highest specified component in the Date Components argument, the algorithm will return the previous existing value of the missing component and preserves the lower components’ values.
ja: Date Components引数の中の最も高位の指定された構成要素に対して次に高位の構成要素の次のインスタンスの最後の前に合致する時刻がないならば、アルゴリズムはその見つからない構成要素のより前の現存する値を返して、より低位の構成要素の値は保ちます。

source: If there was none, it returns the first moment that did exist.
ja: 全く無かったならば、それは存在した最初の瞬間を返します。

source: If there were two midnights, it returns the first.
ja: ２つの真夜中があるならば、それは最初のものを返します。

source: If this cookie attribute is missing, the domain is inferred from the value for NSHTTPCookie Origin URL.
ja: このクッキー属性が見つからないならば、ドメインはNSHTTPCookie Origin URLに対する値から推論されます。

source: If this flag is set, "^" and "$" will also match at the start and end of each line within the input text.
ja: このフラグが設定されるならば、「^」と「$」は、入力されたテキストの範囲内でそれぞれの行の始まりと終わりにもマッチします。

source: If this method is not appropriate for your type of stream, you may return false.
ja: このメソッドがあなたのストリームの型に適さないならば、あなたはfalseを返すかもしれません。

source: If this method returns false and you pass a value for the error parameter, a suitable error object is returned in that parameter.
ja: このメソッドがfalseを返してあなたがある値をerrorパラメータに対して渡すならば、適切なエラーオブジェクトがこのパラメータの中に返されます。

source: If this method returns nil, the object specifier will go on to do its own evaluation, so you should only return nil if that's the behavior you want, or if an error occurs.
ja: このメソッドがnilを返すならば、オブジェクト指定子はそれ自身の評価を引き続き行うでしょう、それでそれがあなたの望む挙動ならば、またはエラーが起こるならば、単にnilを返すべきです。

source: If this method returns false and you specified a value for the error Out parameter, this method returns an error object in the provided pointer.
ja: このメソッドがfalseを返すそしてあなたがある値をerror Outパラメータに指定したならば、このメソッドは提供されたポインタにおいてエラーオブジェクトを返します。

source: If this method returns an array, the object specifier will use the NSNumber objects in it as the indices.
ja: このメソッドが配列を返すならば、オブジェクト指定子はそのNSNumberオブジェクトいくつかをそれにおいてインデックスとして使います。

source: If this parameter is nil, the method uses the current user's language preferences.
ja: パラメータがnilならば、メソッドは現在のユーザの持つ言語環境設定を使います。

source: If this property is nil, the result of this property is ignored.
ja: このプロパティがnilならば、このプロパティの結果は無視されます。

source: If this value is NULL, throws an invalid Argument Exception.
ja: この値がNULLならば、invalid Argument Exceptionをスローします。

source: If this value is nil, throws an invalid Argument Exception.
ja: この値がnilならば、invalid Argument Exceptionをスローします。

source: If unspecified, the logical calendar for the current user is used.
ja: 指定されないならば、現在のユーザに対する論理カレンダーが使われます。

source: If unspecified, the system time zone is used.
ja: 指定されないならば、システムのタイムゾーンが使われます。
